DeviceProcessEvents
| where Timestamp > ago(14d)
| where InitiatingProcessFileName in~ ("winword.exe", "excel.exe", "outlook.exe", "powerpnt.exe", "OneDrive.exe", "ONENOTE.EXE", "Teams.exe")
| where FileName !in~ ("explorer.exe", "dllhost.exe") //These parent processes are expected and cause a lot of noise.
| project Timestamp, AccountName, DeviceName, InitiatingProcessFileName, InitiatingProcessSHA256, FileName, SHA256, ProcessCommandLine 